gap> RelativeInvariantMinimalDegree(SymmetricGroup(5), AlternatingGroup(5));
[ 10, 1 ]
gap> G := TransitiveGroup(11, 4);;
gap> H := TransitiveGroup(11, 2);;
gap> RelativeInvariantMinimalDegree(G, H);
[ 2, 4 ]
gap> PartitionsByDegree(3);
[ [ [ 2, 1 ] ], [  ], [ [ 1, 1, 1 ] ] ]
gap> PartitionsByDegree(4);
[ [ [ 3, 1 ] ], [ [ 2, 2 ] ], [ [ 2, 1, 1 ] ], [  ], [  ], [ [ 1, 1, 1, 1 ] ] 
 ]
